[
  {
      "command": ":save",
      "description": "Save the current graph to a file",
      "usage": "save the graph to a file, format is determined by the file extension (supported formats: svg, tex (LaTex via tikZ), gif, tiff, webp, pdf, png, jp(e)g, json)",
      "args": "<filename>"
  },
  {
      "command": ":show",
      "description": "Show the graph in a given output format (e.g., svg or png in a browser or image viewer) or a summary of the graph in text at the repl. With no arguments, use the default format in the `:config`. Valid formats include svg, tex (LaTex via tikZ), gif, tiff, webp, pdf, png, jp(e)g, json; with json, tex, and latex showing as text at the repl. Valid summaries include graph, nodes, edges, decorations, constraints, and data, focusing on the graph as a whole or particular features, respectively. The `data` summary lists any key-value pairs that have been associated with nodes or edges. See also the `autoshow` configuration parameter.",
      "usage": "show the graph in a given format",
      "args": "[<format>]"
  },
  {
      "command": ":undo",
      "description": "Undo the last command",
      "usage": "undo the last command",
      "args": ""
  },
  {
      "command": ":redo",
      "description": "Redo the last command",
      "usage": "redo the last command",
      "args": ""
  },
  {
    "command": ":reposition",
    "description": "Reposition the nodes in the graph",
    "usage": "reposition the nodes in the graph",
    "args": ""
  },
  {
      "command": ":config",
      "description": "Set a configuration option for the graph or print its value",
      "usage": "set a configuration option for the graph or print its value",
      "args": "[<option> [<value>]]"
  },
  {
      "command": ":reset",
      "description": "Reset the graph to the initial state",
      "usage": "reset the graph to the initial state",
      "args": ""
  },
  {
      "command": ":history",
      "description": "Show the last n commands",
      "usage": "show the last n commands (default: 10)",
      "args": "[<n>]"
  },
  {
      "command": ":exec",
      "description": "Load a file containing commands and tasks, executing the tasks one at a time. The optional `prefix` and `suffix` arguments are, respectively, prepended and appended to the file contents.",
      "usage": "load a file containing commands (preceded and followed by an optional prefix and suffix; one of the delimiters ',', or \" is required and must not appear in the string)",
      "args": "[prefix=''] [suffix=''] <filename>"
  },
  {
    "command": ":exec-batch",
    "description": "Load a file containing commands and tasks, executing all the tasks in one request to the AI model. The optional `prefix` and `suffix` arguments are, respectively, prepended and appended to the file contents.",
    "usage": "load a file containing commands reading all lines at once (preceded and followed by an optional prefix and suffix; one of the delimiters ',', or \" is required and must not appear in the string)",
    "args": "[prefix=''] [suffix=''] <filename>"
  },
  {
      "command": ":load",
      "description": "Load a saved graph as the current state. This resets the chat history so the model 'starts fresh'.",
      "usage": "load a saved graph as the current state",
      "args": "<filename>.json"
  },
  {
      "command": ":multiline",
      "description": "Engage multi-line mode for the next task. Use Ctrl-D to finish the multi-line command, or Ctrl-C to cancel.",
      "usage": "engage multi-line mode for the next task entered.",
      "args": ""
  },
  {
      "command": ":transcript",
      "description": "Save a record of the current session to a file. This file can be exec'd.",
      "usage": "save record of current session to a file",
      "args": "<filename>"
  },
  {
      "command": ":help",
      "description": "With no arguments, show a summary of available commands. With a one word argument, provide help as relevant to that topic as possible. With a many word argument, treat the argument as a request for help and let the model answer. For example, 'What is a valid fill style?' or 'What node shapes are available?'.",
      "usage": "show this help message",
      "args": ""
  },
  {
      "command": ":intro",
      "description": "Give descriptive introduction to how GraphMaker is used",
      "usage": "give descriptive introduction to how GraphMaker is used",
      "args": ""
  },
  {
    "command": ":tips",
    "description": "Print tips on how to phrase your tasks",
    "usage": "print tips on how to phrase your tasks",
    "args": ""
  },
  {
      "command": ":examples",
      "description": "Start an interactive exploration of example prompts and graphs. These can be run or modified in the repl itself.",
      "usage": "give example prompts that can be run or modified to explore GraphMaker",
      "args": ""
  },
  {
      "command": ":exit",
      "description": "Exit the repl",
      "usage": "exit the program",
      "args": ""
  }
]
